pmo-dataset/graphviz/36.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Get airplane request" -> "Check desired\nairplane type";
  "Check desired\nairplane type" -> "Individual\ncustomizing?";
  "ParallelGateway_1" -> "Display bar type";
  "ParallelGateway_1" -> "Select number of\nseats";
  "ParallelGateway_1" -> "Select seat color";
  "ParallelGateway_1" -> "Introduce amount of\nwater in the toilets";
  "Display bar type" -> "Bar type";
  "Select number of\nseats" -> "ParallelGateway_2";
  "Select seat color" -> "ParallelGateway_2";
  "Introduce amount of\nwater in the toilets" -> "ParallelGateway_2";
  "Send customizing\noptions" -> "Receive customizing\nrequirements";
  "Receive customizing\nrequirements" -> "ParallelGateway_1";
  "Send requirements to\nthe russian team" -> "ExclusiveGateway";
  "Send requirements to\nthe irish team" -> "ExclusiveGateway";
  "ExclusiveGateway" -> "Receive bar\ncomponents";
  "Receive bar\ncomponents" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Assemble interior";
  "Sent plane to\ncustomer" -> "Receive customer\nconfirmation";
  "Receive customer\nconfirmation" -> "EndNoneEvent";
  "Test succesful" -> "Ajdust errors" [label="No"];
  "ParallelGateway_3" -> "Flight test";
  "Flight test" -> "Test succesful";
  "ParallelGateway_3" -> "Update flight\nprotocol";
  "Update flight\nprotocol" -> "Send protocol to\ncustomer";
  "Send protocol to\ncustomer" -> "ParallelGateway_4";
  "Test succesful" -> "ParallelGateway_4" [label="Yes"];
  "ParallelGateway_4" -> "Sent plane to\ncustomer";
  "Send requirements to\nfrench team" -> "ExclusiveGateway";
  "Send requirements to\nthe american team" -> "ExclusiveGateway";
  "Send requirements to\nthe italian team" -> "ExclusiveGateway";
  "Assemble interior" -> "ParallelGateway_3";
  "Ajdust errors" -> "Flight test";
  "Individual\ncustomizing?" -> "Send customizing\noptions" [label="Yes"];
  "Individual\ncustomizing?" -> "Assemble interior" [label="No"];
  "Bar type" -> "Send requirements to\nthe russian team" [label="Vodka bar"];
  "Bar type" -> "Send requirements to\nthe irish team" [label="Whiskey bar"];
  "Bar type" -> "Send requirements to\nfrench team" [label="Wine bar"];
  "Bar type" -> "Send requirements to\nthe american team" [label="Cocktail bar"];
  "Bar type" -> "Send requirements to\nthe italian team" [label="Aperol bar"];

  "Get airplane request" [shape=circle];
  "EndNoneEvent" [label="", shape=circle, penwidth=4];
  "Individual\ncustomizing?" [shape=diamond];
  "Bar type" [shape=diamond];
  "ExclusiveGateway" [label="X", shape=diamond];
  "Test succesful" [shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
}
